Still seeing the issue that the created ai notebooks asked to be replaced without any changes in the template:

```tf
resource "google_notebooks_instance" "ai_notebook" {
  provider = google-beta
  name  = "${var.common_data.environment_name}-${var.name}"
  location = var.zone
  machine_type = var.machine_type
  install_gpu_driver = true
  accelerator_config {
    type = var.gpu_type # "NVIDIA_TESLA_T4"
    core_count = var.gpu_count
  }
  vm_image {
    project = "deeplearning-platform-release"
    image_family = var.ai_notebook_instance_family
  }
  network                   = data.google_compute_network.datalab_network.self_link
  subnet                    = data.google_compute_network.datalab_network.subnetworks_self_links[0]

  service_account           = data.google_service_account.datalab_service_account.email
  boot_disk_size_gb         = var.boot_disk_size_gb
  data_disk_size_gb         = var.persistent_disk_size_gb
  labels                    = var.common_data.common_labels
  instance_owners           = var.ai_notebook_user_email
  project                   = var.common_data.project_id
  no_public_ip              = true
  no_proxy_access           = true
}
```
follows by terraform apply produces:
```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.mikhail_notebook_instance.google_notebooks_instance.ai_notebook must be replaced
-/+ resource "google_notebooks_instance" "ai_notebook" {
        boot_disk_size_gb   = 50
      ~ create_time         = "2020-07-29T00:53:40.595477109Z" -> (known after apply)
        data_disk_size_gb   = 200
      - data_disk_type      = "DISK_TYPE_UNSPECIFIED" -> null # forces replacement
      - disk_encryption     = "DISK_ENCRYPTION_UNSPECIFIED" -> null # forces replacement
      ~ id                  = "projects/hsq-dev-analytics-f8a4/locations/us-west1-b/instances/hsq-dev-mikhail-notebook" -> (known after apply)
        install_gpu_driver  = true
        instance_owners     = "mikhail.khodorovskiy@cambiahealth.com"
        labels              = {
            "deployment_name"  = "gcp-hsq-analytics"
            "environment-name" = "hsq-dev"
            "stack-version"    = "88"
        }
        location            = "us-west1-b"
        machine_type        = "n1-standard-2"
        name                = "hsq-dev-mikhail-notebook"
        network             = "https://www.googleapis.com/compute/v1/projects/hsq-dev-analytics-f8a4/global/networks/hsq-dev-analytics-network"
        no_proxy_access     = true
        no_public_ip        = true
      - no_remove_data_disk = false -> null
        project             = "hsq-dev-analytics-f8a4"
      + proxy_uri           = (known after apply)
        service_account     = "hsq-dev-datalab@hsq-dev-analytics-f8a4.iam.gserviceaccount.com"
      ~ state               = "PROVISIONING" -> (known after apply)
        subnet              = "https://www.googleapis.com/compute/v1/projects/hsq-dev-analytics-f8a4/regions/us-west1/subnetworks/analytics-subnet"
      ~ update_time         = "2020-07-29T00:54:21.135917611Z" -> (known after apply)

        accelerator_config {
            core_count = 1
            type       = "NVIDIA_TESLA_T4"
        }

      ~ vm_image {
            image_family = "tf-latest-gpu"
            project      = "deeplearning-platform-release"
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

```
